 <img src="https://eant.tech/imagenes/logo.png" width=25% height=80%  >

## Global Health Observatory data repository

El siguiente conjunto de datos que vamos a trabjar contiene datos sobre las muertes causadas por Tuberculosis, estos datos son recopilados por el observatorio de la Organizacion mundial de la salud.
Los datos se pueden descargar del siguiente [link](
https://apps.who.int/gho/data/node.main.1317?lang=en)

<center>
<img src="https://i.ibb.co/qDWjWCj/logo-who.jpg" alt="logo-who" border="0">
</center>

üè∑Ô∏è 1. Importar pandas

In [1]:
import pandas as pd

üè∑Ô∏è 2. Importar el dataframe que se encuentra en la siguiente URL.

In [2]:
url='https://docs.google.com/spreadsheets/d/e/2PACX-1vR84JOFFZnonTTDgbtc686VZM4w7k-TvJ88OZL82srRyRgS_Aa1N127YYRyI0IalIzWtM3MYnUg2Yxg/pub?output=csv'

In [3]:
df = pd.read_csv(url, sep = ",")

üè∑Ô∏è 3. Visualizar las primeras filas del datafame

In [4]:
df.head()

       Country  ...  Deaths due to tuberculosis among HIV-negative people (per 100 000 population)
0  Afghanistan  ...                                         29 [17-44]
1  Afghanistan  ...                                         30 [18-45]
2  Afghanistan  ...                                         34 [20-51]
3  Afghanistan  ...                                         39 [23-59]
4  Afghanistan  ...                                         43 [25-65]

[5 rows x 4 columns]

üè∑Ô∏è 4. Modificar los nombres de las columnas por los siguientes:
> * 'Country'
> * 'year'
> * 'NroDeaths_ehiv'
> * 'NroDeaths_nhiv'

In [6]:
df.columns = ['Country','year','NroDeaths_ehiv',"NroDeaths_nhiv"]

In [7]:
df

          Country  year      NroDeaths_ehiv NroDeaths_nhiv
0     Afghanistan  2018  11000 [6400-16000]     29 [17-44]
1     Afghanistan  2017  11000 [6400-16000]     30 [18-45]
2     Afghanistan  2016  12000 [7100-18000]     34 [20-51]
3     Afghanistan  2015  14000 [8000-20000]     39 [23-59]
4     Afghanistan  2014  14000 [8400-22000]     43 [25-65]
...           ...   ...                 ...            ...
3647     Zimbabwe  2004    3000 [1200-5600]     25 [10-47]
3648     Zimbabwe  2003    2900 [1200-5400]    24 [9.6-45]
3649     Zimbabwe  2002     2500 [990-4800]    21 [8.3-40]
3650     Zimbabwe  2001    2800 [1100-5300]    23 [9.1-44]
3651     Zimbabwe  2000    3100 [1200-6000]     26 [10-51]

[3652 rows x 4 columns]

üè∑Ô∏è 5. Separar las variable NroDeaths_ehiv y NroDeaths_nhiv en las siguientes:

* NroDeaths_ehiv
 - NroDeaths_ehiv_value
 - NroDeaths_ehiv_intervalo

* NroDeaths_nhiv
 - NroDeaths_nhiv_value
 - NroDeaths_nhiv_intervalo

In [10]:
df["NroDeaths_ehiv_value"] =  [ i.split(" ")[0] for i in df["NroDeaths_ehiv"]]
df["NroDeaths_ehiv_intervalo"] = [ i.split(" ")[1] for i in df["NroDeaths_ehiv"]]

In [12]:
df["NroDeaths_nhiv_value"] =  [ i.split(" ")[0] for i in df["NroDeaths_nhiv"]]
df["NroDeaths_nhiv_intervalo"] = [ i.split(" ")[1] for i in df["NroDeaths_nhiv"]]

In [13]:
df

          Country  year  ... NroDeaths_nhiv_value NroDeaths_nhiv_intervalo
0     Afghanistan  2018  ...                   29                  [17-44]
1     Afghanistan  2017  ...                   30                  [18-45]
2     Afghanistan  2016  ...                   34                  [20-51]
3     Afghanistan  2015  ...                   39                  [23-59]
4     Afghanistan  2014  ...                   43                  [25-65]
...           ...   ...  ...                  ...                      ...
3647     Zimbabwe  2004  ...                   25                  [10-47]
3648     Zimbabwe  2003  ...                   24                 [9.6-45]
3649     Zimbabwe  2002  ...                   21                 [8.3-40]
3650     Zimbabwe  2001  ...                   23                 [9.1-44]
3651     Zimbabwe  2000  ...                   26                  [10-51]

[3652 rows x 8 columns]

üè∑Ô∏è 6. Eliminar las columnas: `NroDeaths_ehiv` y `NroDeaths_nhiv`

In [ ]:
df = df.drop(columns=["NroDeaths_ehiv", "NroDeaths_nhiv"])

üè∑Ô∏è 7. Generar un dataframe que contenga cuatro columnas: 
> * **country**
> * **year**
> * **concepto**: que tenga los datos de las variables roDeaths_ehiv_value y NroDeaths_nhiv_value.
> * **value**

In [16]:
df = df.melt(id_vars= ["Country", "year"], value_vars= ["NroDeaths_ehiv_value", 	"NroDeaths_nhiv_value"], var_name= "concepto", value_name= "value")
df

          Country  year              concepto  value
0     Afghanistan  2018  NroDeaths_ehiv_value  11000
1     Afghanistan  2017  NroDeaths_ehiv_value  11000
2     Afghanistan  2016  NroDeaths_ehiv_value  12000
3     Afghanistan  2015  NroDeaths_ehiv_value  14000
4     Afghanistan  2014  NroDeaths_ehiv_value  14000
...           ...   ...                   ...    ...
7299     Zimbabwe  2004  NroDeaths_nhiv_value     25
7300     Zimbabwe  2003  NroDeaths_nhiv_value     24
7301     Zimbabwe  2002  NroDeaths_nhiv_value     21
7302     Zimbabwe  2001  NroDeaths_nhiv_value     23
7303     Zimbabwe  2000  NroDeaths_nhiv_value     26

[7304 rows x 4 columns]